// XXX Using ctrl+f searching the addresses of the vtbls
// If I note it `Adjacent to SomeVTable`, it's probably in the front of this `SomeVTable`

#define __int8 char
#define __int16 short
#define __int32 int
#define __int64 long long
typedef int HRESULT;

struct _GUID;
struct IUnknown;
struct IUnknown_vtbl;
struct IPersist;
struct IPersist_vtbl;
struct ISequentialStream;
struct ISequentialStream_vtbl;
struct Large_Int_unnamed_type_s;
struct Large_Int_unnamed_type_u;
struct U_Large_Int_unnamed_type_s;
struct U_Large_Int_unnamed_type_u;
struct Tag_FILETIME;
struct TagSTATSTG;
struct Tag_WIN32_FIND_DATAA;
struct IStream;
struct IStream_vtbl;
struct IPersistStream;
struct IPersistStream_vtbl;
struct IRTTITypeInfo;
struct IRTTITypeInfo_vtbl; // XXX Adjacent to AbsVTable
struct INoticeSink;
struct INoticeSink_vtbl; // XXX Adjacent to AbsVTable
struct INoticeSource;
struct INoticeSource_vtbl; // XXX Adjacent to AbsVTable
struct CRCEngine;
struct Vector2D_short;
struct Vector2D_int;
struct Vector3D_int;
struct Vector3D_float;
struct Vector3D_double;
struct Vector4D_float;
struct GenericNode;
struct GenericNode_vtbl; // 0x7E1B0C
struct Node_TL_INIClass_INISection_PTR_TR_;
struct Node_TL_INIClass_INISection_PTR_TR__vtbl; // 0x7EB74C
struct INIClass_INISection;
struct INIClass_INISection_vtbl; // 0x7EB73C
struct IndexClass_TL_int_A_INIClass_INISection_PTR_TR_NodeElement;
struct IndexClass_TL_int_A_INIClass_INISection_PTR_TR_;
struct GenericList;
struct GenericList_vtbl; // 0x7E1B04
struct List_TL_INIClass_INISection_PTR_TR_;
struct List_TL_INIClass_INISection_PTR_TR__vtbl; // 0x7E1AFC
struct List_TL_INIClass_INIEntry_PTR_TR_;
struct List_TL_INIClass_INIEntry_PTR_TR__vtbl; // 0x7EB744
struct Node_TL_INIClass_INIEntry_PTR_TR_;
struct Node_TL_INIClass_INIEntry_PTR_TR__vtbl;
struct INIClass_INIEntry;
struct INIClass_INIEntry_vtbl; // 0x7EB734
struct IndexClass_TL_int_A_INIClass_INIEntry_PTR_TR_NodeElement;
struct IndexClass_TL_int_A_INIClass_INIEntry_PTR_TR_;
struct INIClass_INIComment;
struct INIClass;
struct INIClass_vtbl; // 0x7EA5F4
struct CCINIClass;
struct CCINIClass_vtbl; // 0x7E1AF4
struct FrameTimer;
struct TimerStruct_FrameTimer;
struct StartingTechnoStruct;
struct BaseNodeClass;
struct BaseClass;
struct BaseClass_vtbl; // 0x7E3880
struct IAIHouse;
struct IAIHouse_vtbl;
struct WaypointClass;
struct StorageClass;
struct UnitTrackerClass;
struct ZoneInfoStruct;
struct CounterClass;
struct CounterClass_vtbl; // 0x7E5C54
struct AngerStruct;
struct ScoutStruct;
struct Color16Struct;
struct DropshipStruct;
struct TagCONNECTDATA;
struct IEnumConnections;
struct IEnumConnections_vtbl;
struct ISwizzle;
struct ISwizzle_vtbl;
struct IApplication;
struct IApplication_vtbl;
struct IHouse;
struct IHouse_vtbl;
struct IPublicHouse;
struct IPublicHouse_vtbl;
struct IEnumConnectionPoints;
struct IEnumConnectionPoints_vtbl;
struct IConnectionPointContainer;
struct IConnectionPointContainer_vtbl;
struct IConnectionPoint;
struct IConnectionPoint_vtbl;
struct FixedString_TL_25_A_char_TR_;
struct IndexBitfield_TL_HouseClass_PTR_TR_;
struct ColorStruct;
struct VocClassHeader;
struct VolumeStruct;
struct VocClass;
struct AudioIDXEntry;
struct AudioIDXData;
struct AudioController;
struct MemoryBuffer;
struct LineTrailNode;
struct LineTrail;
struct SHPStruct;
struct SHPFrame;
struct SHPFile;
struct RectangleStruct;
struct RGBClass;
struct TintStruct;
struct Matrix3D;
struct VoxelSectionHeader;
struct VoxelSectionTailer;
struct VoxLib;
struct MotLib;
struct VoxelStruct;
struct VoxelCacheStruct;
struct MainVoxelIndexKey;
struct IndexClass_TL_MainVoxelIndexKey_A_VoxelCacheStruct_PTR_TR_NodeElement;
struct IndexClass_TL_MainVoxelIndexKey_A_VoxelCacheStruct_PTR_TR_;
struct TurretWeaponVoxelIndexKey;
struct IndexClass_TL_TurretWeaponVoxelIndexKey_A_VoxelCacheStruct_PTR_TR_NodeElement;
struct IndexClass_TL_TurretWeaponVoxelIndexKey_A_VoxelCacheStruct_PTR_TR_;
struct ShadowVoxelIndexKey;
struct IndexClass_TL_ShadowVoxelIndexKey_A_VoxelCacheStruct_PTR_TR_NodeElement;
struct IndexClass_TL_ShadowVoxelIndexKey_A_VoxelCacheStruct_PTR_TR_;
struct TurretBarrelVoxelIndexKey;
struct IndexClass_TL_TurretBarrelVoxelIndexKey_A_VoxelCacheStruct_PTR_TR_NodeElement;
struct IndexClass_TL_TurretBarrelVoxelIndexKey_A_VoxelCacheStruct_PTR_TR_;
struct StageClass;
struct Quaternion;
struct BounceClass;
struct RandomStruct;
struct ScriptActionNode;
struct RectangleStruct_Unknown_Type;
struct TaskForceEntryStruct;
struct ControlNode;
struct SpawnControl;
struct SlaveManagerClass_SlaveControl;
struct AITriggerConditionComparator;
struct PriorityQueueClassNode;
struct PriorityQueueClass_TL_PriorityQueueClassNode_A_std_less_TL_PriorityQueueClassNode_TR_TR_;
struct TiberiumLogic;
struct BulletData;
struct BytePalette;
struct ColorScheme;
struct FlashData;
struct PassengersClass;
struct VeterancyStruct;
struct TransitionTimer;
struct DirStruct;
struct FacingClass;
struct TurretControl;
struct RecoilData;
struct WeaponStruct;
struct AbilitiesStruct;
struct IGameMap;
struct IGameMap_vtbl;
struct BuildType;
struct StripClass;
struct TabDataClass;
struct SubzoneConnectionStruct;
struct SubzoneTrackingStruct;
struct LTRBStruct;
struct Crate;
struct ZoneConnectionClass;
struct CellLevelPassabilityStruct;
struct LevelAndPassabilityStruct2;
struct RateTimer;
struct BuildingAnimFrameStruct;
struct BuildingAnimStruct;
struct ReservedVoxelIndexKey;
struct ILocomotion;
struct ILocomotion_vtbl; // XXX Adjacent to LocoVTable
struct LocomotionID;
struct IFlyControl;
struct IFlyControl_vtbl;
struct SubSequenceStruct;
struct SequenceStruct;
struct PlanningMemberClass;
struct PlanningBranchClass;
struct PlanningNodeClass;
struct PlanningTokenClass;
struct RadBeam;
struct EBolt;
struct LaserDrawClass;
struct HWND__;
struct MPTeam;
struct MPTeam_vtbl; // 0x7EEEDC
struct Wstring_base_TL_wchar_t_A_WCharTrait_TR_;
struct Wstring_base_TL_char_A_CharTrait_TR_;
struct AISlotsStruct;
struct GameModeOptionsClass;
struct SessionOptionsClass;
struct IPXAddressClass;
struct SessionClass_TL_unnamed_type_MPStats_TR_;
struct MultiMission;
struct In_addr_unnamed_type_un_u_b;
struct In_addr_unnamed_type_un_u_w;
struct In_addr;
struct sockaddr_in;
struct NodeNameType;
struct SessionClass;
struct IonBlastClass;
struct RadarEventClass;
struct Theater;
struct VoxClass;
struct RocketStruct;
struct DifficultyStruct;
struct ScenarioFlags;
struct Randomizer;
struct Variable;
struct LightingStruct;
struct RulesClass;
struct ScenarioClass;
struct SwizzlePointerClass;
struct SwizzleManagerClass;
struct SwizzleManagerClass_vtbl; // 0x7F4108
struct ABuffer;
struct ZBuffer;
struct SUR_D_D_PIXEL_FORMAT_unnamed_tag_u_type_MultiSampleCaps;
struct SUR_D_D_PIXEL_FORMAT;
struct SUR_D_D_SCAPS2;
struct SUR_D_D_COLOR_KEY;
struct SUR_D_D_SURFACE_DESC2;
struct IPiggyback;
struct IPiggyback_vtbl; // XXX Adjacent to LocoVTable
struct FixedString_32_A_char;
struct FixedString_128_A_wchar_t;
struct FixedString_64_A_wchar_t;
struct FileEntryClass;
struct LoadOptionsClass;
struct LoadOptionsClass_vtbl; // 0x7ED2E4
struct VeinholeLogic;
struct TargetClass;
struct TacticalSelectableStruct;
struct EventClass_EMPTY;
struct EventClass_POWERON;
struct EventClass_POWEROFF;
struct EventClass_ALLY;
struct EventClass_MEGAMISSION;
struct EventClass_MEGAMISSION_F;
struct EventClass_IDLE;
struct EventClass_SCATTER;
struct EventClass_DESTRUCT;
struct EventClass_DEPLOY;
struct EventClass_DETONATE;
struct EventClass_PLACE;
struct EventClass_OPTIONS;
struct EventClass_GAMESPEED;
struct EventClass_PRODUCE;
struct EventClass_SUSPEND;
struct EventClass_ABANDON;
struct EventClass_PRIMARY;
struct EventClass_SPECIAL_PLACE;
struct EventClass_EXIT;
struct EventClass_ANIMATION;
struct EventClass_REPAIR;
struct EventClass_SELL;
struct EventClass_SELLCELL;
struct EventClass_SPECIAL;
struct EventClass_FRAMESYNC;
struct EventClass_MESSAGE;
struct EventClass_RESPONSE_TIME;
struct EventClass_FRAMEINFO;
struct EventClass_SAVEGAME;
struct EventClass_ARCHIVE;
struct EventClass_ADDPLAYER;
struct EventClass_TIMING;
struct EventClass_PROCESS_TIME;
struct EventClass_PAGEUSER;
struct EventClass_REMOVEPLAYER;
struct EventClass_LATENCYFUDGE;
struct EventClass_MEGAFRAMEINFO;
struct EventClass_PACKETTIMING;
struct EventClass_ABOUTTOEXIT;
struct EventClass_FALLBACKHOST;
struct EventClass_ADDRESSCHANGE;
struct EventClass_PLANCONNECT;
struct EventClass_PLANCOMMIT;
struct EventClass_PLANNODEDELETE;
struct EventClass_ALLCHEER;
struct EventClass_ABANDON_ALL;
struct EventClass;
struct EventList_OutList;
struct EventList_DoList;
struct EventList_MegaMissionList;
struct AircraftTrackerClass;
struct ToolTip;
struct IndexClass_TL_int_A_ToolTip_PTR_TR_NodeElement;
struct IndexClass_TL_int_A_ToolTip_PTR_TR_;
struct ToolTipManagerData;
struct ToolTipManager;
struct ToolTipManager_vtbl; // 0x7F57AC
struct CCToolTip;
struct CCToolTip_vtbl; // 0x7F74C4
struct AudioStream;
struct ThemeClass;
struct ThemeControl;
struct KamikazeControl;
struct Kamikaze;
struct SpotLightClass;
struct DirtyAreaStruct;
struct BombListClass;
struct WWMouseClass;
struct WWMouseClass_vtbl; // 0x7F7B2C
struct IndexClass_TL_int_A_int_TR_NodeElement;
struct IndexClass_TL_int_A_int_TR_;
struct InputManagerClass; // 0x87F770
struct AlphaLightingRemapClass;
struct GameOptionsClass;
struct BasePlanningCell;
struct BasePlanningCellContainer;
struct SHPReference;
struct MessageListClass;
struct BitFont;
struct BitFont_vtbl;
struct BitFont_InternalData;

// TODO STRUCT

struct VectorClass_int;
struct VectorClass_int_vtbl; // 0x7E4DB8
struct DynamicVectorClass_int;
struct DynamicVectorClass_int_vtbl; // 0x7E4E78
struct TypeList_int;
struct TypeList_int_vtbl; // 0x7E4DD8
struct VectorClass_char_PTR;
struct VectorClass_char_PTR_vtbl; // 0x7E5C24 / 0x7EE0D4
struct DynamicVectorClass_char_PTR;
struct DynamicVectorClass_char_PTR_vtbl; // 0x7E5C04 / 0x7EE0B4
struct VectorClass_unsigned_char_PTR;
struct VectorClass_unsigned_char_PTR_vtbl; // 0x7F7B0C
struct DynamicVectorClass_unsigned_char_PTR;
struct DynamicVectorClass_unsigned_char_PTR_vtbl; // 0x7F7AEC
struct VectorClass_unsigned_char;
struct VectorClass_unsigned_char_vtbl; // 0x7F65F4
struct VectorClass_unsigned_int;
struct VectorClass_unsigned_int_vtbl; // 0x7E37EC
struct DynamicVectorClass_unsigned_int;
struct DynamicVectorClass_unsigned_int_vtbl; // 0x7E37CC
struct VectorClass_unsigned_short;
struct VectorClass_unsigned_short_vtbl; // 0x7E3824
struct DynamicVectorClass_unsigned_short;
struct DynamicVectorClass_unsigned_short_vtbl; // 0x7E3844
struct VectorClass_bool;
struct VectorClass_bool_vtbl; // 0x7EAA5C
struct DynamicVectorClass_bool;
struct DynamicVectorClass_bool_vtbl; // 0x7EAA7C
struct VectorClass_double;
struct VectorClass_double_vtbl; // 0x7EDA4C
struct DynamicVectorClass_double;
struct DynamicVectorClass_double_vtbl; // 0x7EDA6C
struct VectorClass_unsigned_long;
struct VectorClass_unsigned_long_vtbl; // 0x7F3748
struct DynamicVectorClass_unsigned_long; // 0xB0BC88
struct DynamicVectorClass_unsigned_long_vtbl; // 0x7F3728
struct VectorClass_unsigned_short_PTR;
struct VectorClass_unsigned_short_PTR_vtbl; // 0x7ECD0C / 0x7ED1FC
struct DynamicVectorClass_unsigned_short_PTR;
struct DynamicVectorClass_unsigned_short_PTR_vtbl; // 0x7ECCEC / 0x7ED1DC
struct VectorClass_HWND___PTR;
struct VectorClass_HWND___PTR_vtbl; // 0x7EECAC
struct DynamicVectorClass_HWND___PTR;
struct DynamicVectorClass_HWND___PTR_vtbl; // 0x7EEC8C
struct VectorClass_DirtyAreaStruct_PTR;
struct VectorClass_DirtyAreaStruct_PTR_vtbl; // 0x7F42BC
struct DynamicVectorClass_DirtyAreaStruct_PTR; // 0xB0CE78
struct DynamicVectorClass_DirtyAreaStruct_PTR_vtbl; // 0x7F429C
struct VectorClass_CCINIClass_PTR;
struct VectorClass_CCINIClass_PTR_vtbl; // 0x7EB80C
struct DynamicVectorClass_CCINIClass_PTR;
struct DynamicVectorClass_CCINIClass_PTR_vtbl; // 0x7EB82C
struct VectorClass_PassabilityType;
struct VectorClass_PassabilityType_vtbl; // 0x7ED560
struct DynamicVectorClass_PassabilityType;
struct DynamicVectorClass_PassabilityType_vtbl; // 0x7ED580
struct VectorClass_IConnectionPoint_PTR;
struct VectorClass_IConnectionPoint_PTR_vtbl; // 0x7E5D08
struct DynamicVectorClass_IConnectionPoint_PTR;
struct DynamicVectorClass_IConnectionPoint_PTR_vtbl; // 0x7E5D48
struct VectorClass_MPTeam_PTR;
struct VectorClass_MPTeam_PTR_vtbl; // 0x7EEE54
struct DynamicVectorClass_MPTeam_PTR;
struct DynamicVectorClass_MPTeam_PTR_vtbl; // 0x7EEE34
struct VectorClass_MultiMission_PTR;
struct VectorClass_MultiMission_PTR_vtbl; // 0x7EEF50 / 0x7F1214
struct DynamicVectorClass_MultiMission_PTR;
struct DynamicVectorClass_MultiMission_PTR_vtbl; // 0x7EEF70 / 0x7F11F4
struct VectorClass_NodeNameType_PTR;
struct VectorClass_NodeNameType_PTR_vtbl; // 0x7EE390
struct DynamicVectorClass_NodeNameType_PTR; // 0xA8DA74
struct DynamicVectorClass_NodeNameType_PTR_vtbl; // 0x7EE370
struct VectorClass_SmudgeTypeClass_PTR;
struct VectorClass_SmudgeTypeClass_PTR_vtbl; // 0x7F0D7C / 0x7EA1C4
struct DynamicVectorClass_SmudgeTypeClass_PTR; // 0xA8EC18
struct DynamicVectorClass_SmudgeTypeClass_PTR_vtbl; // 0x7F0DEC / 0x7EA1A4
struct TypeList_SmudgeTypeClass_PTR;
struct TypeList_SmudgeTypeClass_PTR_vtbl; // 0x7F0D1C
struct VectorClass_CommandClass_PTR;
struct VectorClass_CommandClass_PTR_vtbl; // 0x7E184C
struct DynamicVectorClass_CommandClass_PTR; // 0x87F658
struct DynamicVectorClass_CommandClass_PTR_vtbl; // 0x7E182C
struct VectorClass_AngerStruct;
struct VectorClass_AngerStruct_vtbl; // 0x7EA984
struct DynamicVectorClass_AngerStruct;
struct DynamicVectorClass_AngerStruct_vtbl; // 0x7EA924
struct VectorClass_ScoutStruct;
struct VectorClass_ScoutStruct_vtbl; // 0x7EA9A4
struct DynamicVectorClass_ScoutStruct;
struct DynamicVectorClass_ScoutStruct_vtbl; // 0x7EA904
struct VectorClass_ColorScheme_PTR;
struct VectorClass_ColorScheme_PTR_vtbl; // 0x7EF7B0
struct DynamicVectorClass_ColorScheme_PTR; // 0xB054D0
struct DynamicVectorClass_ColorScheme_PTR_vtbl; // 0x7EF790
struct VectorClass_Color16Struct_PTR;
struct VectorClass_Color16Struct_PTR_vtbl;
struct DynamicVectorClass_Color16Struct_PTR;
struct DynamicVectorClass_Color16Struct_PTR_vtbl;
struct VectorClass_RGBClass_PTR;
struct VectorClass_RGBClass_PTR_vtbl; // 0x7E4E38
struct DynamicVectorClass_RGBClass_PTR;
struct DynamicVectorClass_RGBClass_PTR_vtbl; // 0x7F022C
struct TypeList_RGBClass_PTR;
struct TypeList_RGBClass_PTR_vtbl; // 0x7E4E58
struct VectorClass_SubzoneConnectionStruct;
struct VectorClass_SubzoneConnectionStruct_vtbl; // 0x7E177C
struct DynamicVectorClass_SubzoneConnectionStruct;
struct DynamicVectorClass_SubzoneConnectionStruct_vtbl; // 0x7ED5A0
struct VectorClass_SubzoneTrackingStruct;
struct VectorClass_SubzoneTrackingStruct_vtbl; // 0x7ED500
struct DynamicVectorClass_SubzoneTrackingStruct;
struct DynamicVectorClass_SubzoneTrackingStruct_vtbl; // 0x7ED4A0
struct VectorClass_ZoneConnectionClass;
struct VectorClass_ZoneConnectionClass_vtbl; // 0x7ED4E0
struct DynamicVectorClass_ZoneConnectionClass;
struct DynamicVectorClass_ZoneConnectionClass_vtbl; // 0x7ED4C0
struct VectorClass_FileEntryClass_PTR;
struct VectorClass_FileEntryClass_PTR_vtbl; // 0x7ED32C
struct DynamicVectorClass_FileEntryClass_PTR;
struct DynamicVectorClass_FileEntryClass_PTR_vtbl; // 0x7ED30C
struct VectorClass_ToolTip_PTR;
struct VectorClass_ToolTip_PTR_vtbl; // 0x7F57E8
struct DynamicVectorClass_ToolTip_PTR;
struct DynamicVectorClass_ToolTip_PTR_vtbl; // 0x7F57C8
struct VectorClass_SwizzlePointerClass;
struct VectorClass_SwizzlePointerClass_vtbl; // 0x7F4154
struct DynamicVectorClass_SwizzlePointerClass;
struct DynamicVectorClass_SwizzlePointerClass_vtbl; // 0x7F4134
struct VectorClass_PlanningMemberClass_PTR;
struct VectorClass_PlanningMemberClass_PTR_vtbl; // 0x7EFF04
struct DynamicVectorClass_PlanningMemberClass_PTR;
struct DynamicVectorClass_PlanningMemberClass_PTR_vtbl; // 0x7EFEE4
struct VectorClass_PlanningBranchClass_PTR;
struct VectorClass_PlanningBranchClass_PTR_vtbl; // 0x7EFF24
struct DynamicVectorClass_PlanningBranchClass_PTR;
struct DynamicVectorClass_PlanningBranchClass_PTR_vtbl; // 0x7EFEC4
struct VectorClass_PlanningNodeClass_PTR;
struct VectorClass_PlanningNodeClass_PTR_vtbl; // 0x7EFE64
struct DynamicVectorClass_PlanningNodeClass_PTR; // 0xAC4B30 / 0xAC4C18 / 0xAC4C98
struct DynamicVectorClass_PlanningNodeClass_PTR_vtbl; // 0x7EFE44
struct VectorClass_PlanningTokenClass_PTR;
struct VectorClass_PlanningTokenClass_PTR_vtbl; // 0x7EFEA4
struct DynamicVectorClass_PlanningTokenClass_PTR; // 0xAC4C78
struct DynamicVectorClass_PlanningTokenClass_PTR_vtbl; // 0x7EFE84
struct VectorClass_WaypointClass;
struct VectorClass_WaypointClass_vtbl; // 0x7F6EF4
struct DynamicVectorClass_WaypointClass;
struct DynamicVectorClass_WaypointClass_vtbl; // 0x7F6ED4
struct VectorClass_WaypointPathClass_PTR;
struct VectorClass_WaypointPathClass_PTR_vtbl; // 0x7F6E24
struct DynamicVectorClass_WaypointPathClass_PTR; // 0xB72608
struct DynamicVectorClass_WaypointPathClass_PTR_vtbl; // 0x7F6E04
struct VectorClass_BaseNodeClass;
struct VectorClass_BaseNodeClass_vtbl; // 0x7E38F0
struct DynamicVectorClass_BaseNodeClass;
struct DynamicVectorClass_BaseNodeClass_vtbl; // 0x7E38B0
struct VectorClass_TagClass_PTR;
struct VectorClass_TagClass_PTR_vtbl; // 0x7EA5C4
struct DynamicVectorClass_TagClass_PTR; // 0x8B40C8 / 0x8B41A8 / 0xB0E720
struct DynamicVectorClass_TagClass_PTR_vtbl; // 0x7EA5A4
struct VectorClass_TagTypeClass_PTR;
struct VectorClass_TagTypeClass_PTR_vtbl; // 0x7F4578
struct DynamicVectorClass_TagTypeClass_PTR; // 0xB0E780
struct DynamicVectorClass_TagTypeClass_PTR_vtbl; // 0x7F4558
struct VectorClass_ThemeClass_PTR;
struct VectorClass_ThemeClass_PTR_vtbl;
struct DynamicVectorClass_ThemeClass_PTR;
struct DynamicVectorClass_ThemeClass_PTR_vtbl;
struct VectorClass_StartingTechnoStruct_PTR;
struct VectorClass_StartingTechnoStruct_PTR_vtbl; // 0x7EA964
struct DynamicVectorClass_StartingTechnoStruct_PTR;
struct DynamicVectorClass_StartingTechnoStruct_PTR_vtbl; // 0x7EA944
struct VectorClass_CellStruct;
struct VectorClass_CellStruct_vtbl; // 0x7E38D0
struct DynamicVectorClass_CellStruct;
struct DynamicVectorClass_CellStruct_vtbl; // 0x7E3890
struct VectorClass_CoordStruct;
struct VectorClass_CoordStruct_vtbl;
struct VectorClass_Point2D;
struct VectorClass_Point2D_vtbl; // 0x7EEB74
struct DynamicVectorClass_Point2D;
struct DynamicVectorClass_Point2D_vtbl; // 0x7EEB54
struct VectorClass_AbstractClass_PTR;
struct VectorClass_AbstractClass_PTR_vtbl; // 0x7E920C
struct DynamicVectorClass_AbstractClass_PTR; // 0xB0F720 / 0x8A0390
struct DynamicVectorClass_AbstractClass_PTR_vtbl; // 0x7E91EC
struct VectorClass_AbstractTypeClass_PTR;
struct VectorClass_AbstractTypeClass_PTR_vtbl; // 0x7EA544
struct DynamicVectorClass_AbstractTypeClass_PTR; // 0xA8E968
struct DynamicVectorClass_AbstractTypeClass_PTR_vtbl; // 0x7EA524
struct VectorClass_CellClass_PTR;
struct VectorClass_CellClass_PTR_vtbl; // 0x7ED480
struct DynamicVectorClass_CellClass_PTR;
struct DynamicVectorClass_CellClass_PTR_vtbl; // 0x7ED9BC
struct VectorClass_ObjectClass_PTR;
struct VectorClass_ObjectClass_PTR_vtbl; // 0x7E192C
struct DynamicVectorClass_ObjectClass_PTR; // 0x87F778 (LogicClass) / 0x8A0360 / 0xA8E360 / 0xA8ECB8 / 0xB0F698 / 0xAC1418
struct DynamicVectorClass_ObjectClass_PTR_vtbl; // 0x7E4F64
struct VectorClass_ObjectTypeClass_PTR;
struct VectorClass_ObjectTypeClass_PTR_vtbl; // 0x7EF28C
struct DynamicVectorClass_ObjectTypeClass_PTR;
struct DynamicVectorClass_ObjectTypeClass_PTR_vtbl; // 0x7EF26C
struct VectorClass_TechnoClass_PTR;
struct VectorClass_TechnoClass_PTR_vtbl; // 0x7E180C
struct DynamicVectorClass_TechnoClass_PTR; // 0xA8EC78 / 0xAC4C40
struct DynamicVectorClass_TechnoClass_PTR_vtbl; // 0x7E17AC
struct VectorClass_TechnoTypeClass_PTR;
struct VectorClass_TechnoTypeClass_PTR_vtbl; // 0x7E4DF8 / 0x7E8954
struct DynamicVectorClass_TechnoTypeClass_PTR; // 0xA8EB00
struct DynamicVectorClass_TechnoTypeClass_PTR_vtbl; // 0x7E858C / 0x7E8934
struct TypeList_TechnoTypeClass_PTR;
struct TypeList_TechnoTypeClass_PTR_vtbl; // 0x7E4E18
struct VectorClass_FootClass_PTR;
struct VectorClass_FootClass_PTR_vtbl; // 0x7E8C48
struct DynamicVectorClass_FootClass_PTR; // 0x8B3DC0
struct DynamicVectorClass_FootClass_PTR_vtbl; // 0x7E8C28
struct VectorClass_InfantryClass_PTR;
struct VectorClass_InfantryClass_PTR_vtbl; // 0x7E43E8
struct DynamicVectorClass_InfantryClass_PTR; // 0xA83DE8
struct DynamicVectorClass_InfantryClass_PTR_vtbl; // 0x7E43C8
struct VectorClass_InfantryTypeClass_PTR;
struct VectorClass_InfantryTypeClass_PTR_vtbl; // 0x7EAC28 / 0x7EA344
struct DynamicVectorClass_InfantryTypeClass_PTR; // 0xA8E348
struct DynamicVectorClass_InfantryTypeClass_PTR_vtbl; // 0x7EAC88 / 0x7EA324
struct TypeList_InfantryTypeClass_PTR;
struct TypeList_InfantryTypeClass_PTR_vtbl; // 0x7EAC08
struct VectorClass_UnitClass_PTR;
struct VectorClass_UnitClass_PTR_vtbl; // 0x7E9EC4
struct DynamicVectorClass_UnitClass_PTR; // 0x8B4108
struct DynamicVectorClass_UnitClass_PTR_vtbl; // 0x7E9EA4
struct VectorClass_UnitTypeClass_PTR;
struct VectorClass_UnitTypeClass_PTR_vtbl; // 0x7EAC48 / 0x7EA2C4
struct DynamicVectorClass_UnitTypeClass_PTR; // 0xA83CE0
struct DynamicVectorClass_UnitTypeClass_PTR_vtbl; // 0x7EACA8 / 0x7EA2A4
struct TypeList_UnitTypeClass_PTR;
struct TypeList_UnitTypeClass_PTR_vtbl; // 0x7EABE8
struct VectorClass_AircraftClass_PTR;
struct VectorClass_AircraftClass_PTR_vtbl; // 0x7E9E84
struct DynamicVectorClass_AircraftClass_PTR; // 0xA8E390
struct DynamicVectorClass_AircraftClass_PTR_vtbl; // 0x7E9E64
struct VectorClass_AircraftTypeClass_PTR;
struct VectorClass_AircraftTypeClass_PTR_vtbl; // 0x7EAC68 / 0x7EA284
struct DynamicVectorClass_AircraftTypeClass_PTR; // 0xA8B218
struct DynamicVectorClass_AircraftTypeClass_PTR_vtbl; // 0x7EACC8 / 0x7EA264
struct TypeList_AircraftTypeClass_PTR;
struct TypeList_AircraftTypeClass_PTR_vtbl; // 0x7EABC8
struct VectorClass_BuildingClass_PTR;
struct VectorClass_BuildingClass_PTR_vtbl; // 0x7E9E44
struct DynamicVectorClass_BuildingClass_PTR; // 0x8B41E0 / 0xA8EB40
struct DynamicVectorClass_BuildingClass_PTR_vtbl; // 0x7E9E24
struct VectorClass_BuildingTypeClass_PTR;
struct VectorClass_BuildingTypeClass_PTR_vtbl; // 0x7EA244 / 0x7EAA08
struct DynamicVectorClass_BuildingTypeClass_PTR; // 0xA83C68
struct DynamicVectorClass_BuildingTypeClass_PTR_vtbl; // 0x7EA224 / 0x7EAA28
struct TypeList_BuildingTypeClass_PTR;
struct TypeList_BuildingTypeClass_PTR_vtbl; // 0x7ED90C
struct VectorClass_SuperClass_PTR;
struct VectorClass_SuperClass_PTR_vtbl; // 0x7EA504
struct DynamicVectorClass_SuperClass_PTR; // 0xA83CB8 / 0xA83D50
struct DynamicVectorClass_SuperClass_PTR_vtbl; // 0x7EA4E4
struct VectorClass_SuperWeaponTypeClass_PTR;
struct VectorClass_SuperWeaponTypeClass_PTR_vtbl; // 0x7EA4C4
struct DynamicVectorClass_SuperWeaponTypeClass_PTR; // 0xA8E330
struct DynamicVectorClass_SuperWeaponTypeClass_PTR_vtbl; // 0x7EA4A4
struct VectorClass_WeaponTypeClass_PTR;
struct VectorClass_WeaponTypeClass_PTR_vtbl; // 0x7E1EF4
struct DynamicVectorClass_WeaponTypeClass_PTR; // 0x887568
struct DynamicVectorClass_WeaponTypeClass_PTR_vtbl; // 0x7E1ED4
struct VectorClass_WarheadTypeClass_PTR;
struct VectorClass_WarheadTypeClass_PTR_vtbl; // 0x7E1EA4
struct DynamicVectorClass_WarheadTypeClass_PTR; // 0x8874C0
struct DynamicVectorClass_WarheadTypeClass_PTR_vtbl; // 0x7E1E84
struct VectorClass_BulletClass_PTR;
struct VectorClass_BulletClass_PTR_vtbl; // 0x7E4698
struct DynamicVectorClass_BulletClass_PTR; // 0x89DE18 / 0xA8ED40
struct DynamicVectorClass_BulletClass_PTR_vtbl; // 0x7E4678
struct VectorClass_BulletTypeClass_PTR;
struct VectorClass_BulletTypeClass_PTR_vtbl; // 0x7EA384
struct DynamicVectorClass_BulletTypeClass_PTR; // 0xA83C80
struct DynamicVectorClass_BulletTypeClass_PTR_vtbl; // 0x7EA364
struct VectorClass_FactoryClass_PTR;
struct VectorClass_FactoryClass_PTR_vtbl; // 0x7E9FC4
struct DynamicVectorClass_FactoryClass_PTR; // 0xA83E30
struct DynamicVectorClass_FactoryClass_PTR_vtbl; // 0x7E9FA4
struct VectorClass_BuildingLightClass_PTR;
struct VectorClass_BuildingLightClass_PTR_vtbl; // 0x7E9C44
struct DynamicVectorClass_BuildingLightClass_PTR; // 0x8B4190
struct DynamicVectorClass_BuildingLightClass_PTR_vtbl; // 0x7E9C24
struct VectorClass_ControlNode_PTR;
struct VectorClass_ControlNode_PTR_vtbl; // 0x7E4BC4
struct DynamicVectorClass_ControlNode_PTR;
struct DynamicVectorClass_ControlNode_PTR_vtbl; // 0x7E4BA4
struct VectorClass_SpawnControl_PTR;
struct VectorClass_SpawnControl_PTR_vtbl; // 0x7F36D4
struct DynamicVectorClass_SpawnControl_PTR;
struct DynamicVectorClass_SpawnControl_PTR_vtbl; // 0x7F36B4
struct VectorClass_SlaveControl_PTR;
struct VectorClass_SlaveControl_PTR_vtbl; // 0x7F324C
struct DynamicVectorClass_SlaveControl_PTR;
struct DynamicVectorClass_SlaveControl_PTR_vtbl; // 0x7F322C
struct VectorClass_ParticleClass_PTR;
struct VectorClass_ParticleClass_PTR_vtbl; // 0x7E9D84
struct DynamicVectorClass_ParticleClass_PTR; // 0xA83DC8
struct DynamicVectorClass_ParticleClass_PTR_vtbl; // 0x7E9D64
struct VectorClass_ParticleTypeClass_PTR;
struct VectorClass_ParticleTypeClass_PTR_vtbl; // 0x7EA444
struct DynamicVectorClass_ParticleTypeClass_PTR; // 0xA83D98
struct DynamicVectorClass_ParticleTypeClass_PTR_vtbl; // 0x7EA424
struct VectorClass_ParticleSystemClass_PTR;
struct VectorClass_ParticleSystemClass_PTR_vtbl; // 0x7E9C84
struct DynamicVectorClass_ParticleSystemClass_PTR; // 0xA80208
struct DynamicVectorClass_ParticleSystemClass_PTR_vtbl; // 0x7E9C64
struct VectorClass_ParticleSystemTypeClass_PTR;
struct VectorClass_ParticleSystemTypeClass_PTR_vtbl; // 0x7E4424 / 0x7EA484
struct DynamicVectorClass_ParticleSystemTypeClass_PTR; // 0xA83D68
struct DynamicVectorClass_ParticleSystemTypeClass_PTR_vtbl; // 0x7E4444 / 0x7EA464
struct TypeList_ParticleSystemTypeClass_PTR;
struct TypeList_ParticleSystemTypeClass_PTR_vtbl; // 0x7F4F9C
struct VectorClass_TiberiumClass_PTR;
struct VectorClass_TiberiumClass_PTR_vtbl; // 0x7F56DC
struct DynamicVectorClass_TiberiumClass_PTR; // 0xB0F4E8
struct DynamicVectorClass_TiberiumClass_PTR_vtbl; // 0x7F56BC
struct VectorClass_TerrainClass_PTR;
struct VectorClass_TerrainClass_PTR_vtbl; // 0x7E9E04
struct DynamicVectorClass_TerrainClass_PTR; // 0xA8E988
struct DynamicVectorClass_TerrainClass_PTR_vtbl; // 0x7E9DE4
struct VectorClass_TerrainTypeClass_PTR;
struct VectorClass_TerrainTypeClass_PTR_vtbl; // 0x7F0D9C / 0x7EA204
struct DynamicVectorClass_TerrainTypeClass_PTR; // 0xA8E318
struct DynamicVectorClass_TerrainTypeClass_PTR_vtbl; // 0x7F0E0C / 0x7EA1E4
struct TypeList_TerrainTypeClass_PTR;
struct TypeList_TerrainTypeClass_PTR_vtbl; // 0x7F0CFC
struct VectorClass_OverlayClass_PTR;
struct VectorClass_OverlayClass_PTR_vtbl; // 0x7E9D44
struct DynamicVectorClass_OverlayClass_PTR; // 0xA8EC50
struct DynamicVectorClass_OverlayClass_PTR_vtbl; // 0x7E9D24
struct VectorClass_OverlayTypeClass_PTR;
struct VectorClass_OverlayTypeClass_PTR_vtbl; // 0x7EA184
struct DynamicVectorClass_OverlayTypeClass_PTR; // 0xA83D80
struct DynamicVectorClass_OverlayTypeClass_PTR_vtbl; // 0x7EA164
struct VectorClass_IsometricTileClass_PTR;
struct VectorClass_IsometricTileClass_PTR_vtbl; // 0x7E18DC
struct DynamicVectorClass_IsometricTileClass_PTR; // 0x87F750
struct DynamicVectorClass_IsometricTileClass_PTR_vtbl; // 0x7E18BC
struct VectorClass_IsometricTileTypeClass_PTR;
struct VectorClass_IsometricTileTypeClass_PTR_vtbl; // 0x7EA404
struct DynamicVectorClass_IsometricTileTypeClass_PTR; // 0xA8ED28
struct DynamicVectorClass_IsometricTileTypeClass_PTR_vtbl; // 0x7EA3E4
struct VectorClass_VeinholeMonsterClass_PTR;
struct VectorClass_VeinholeMonsterClass_PTR_vtbl; // 0x7F665C
struct DynamicVectorClass_VeinholeMonsterClass_PTR; // 0xB1D290
struct DynamicVectorClass_VeinholeMonsterClass_PTR_vtbl; // 0x7F663C
struct VectorClass_BombClass_PTR;
struct VectorClass_BombClass_PTR_vtbl; // 0x7E17EC
struct DynamicVectorClass_BombClass_PTR; // 0x89C668
struct DynamicVectorClass_BombClass_PTR_vtbl; // 0x7E17CC
struct VectorClass_NeuronClass_PTR;
struct VectorClass_NeuronClass_PTR_vtbl; // 0x7E3E54
struct VectorClass_CaptureManagerClass_PTR;
struct VectorClass_CaptureManagerClass_PTR_vtbl; // 0x7E4AF4
struct DynamicVectorClass_CaptureManagerClass_PTR; // 0x89E0F0
struct DynamicVectorClass_CaptureManagerClass_PTR_vtbl; // 0x7E4AD4
struct VectorClass_SlaveManagerClass_PTR;
struct VectorClass_SlaveManagerClass_PTR_vtbl; // 0x7F317C
struct DynamicVectorClass_SlaveManagerClass_PTR; // 0xB0B5F0
struct DynamicVectorClass_SlaveManagerClass_PTR_vtbl; // 0x7F315C
struct VectorClass_SpawnManagerClass_PTR;
struct VectorClass_SpawnManagerClass_PTR_vtbl; // 0x7F3604
struct DynamicVectorClass_SpawnManagerClass_PTR; // 0xB0B880
struct DynamicVectorClass_SpawnManagerClass_PTR_vtbl; // 0x7F35E4
struct VectorClass_AirstrikeClass_PTR;
struct VectorClass_AirstrikeClass_PTR_vtbl; // 0x7E295C
struct DynamicVectorClass_AirstrikeClass_PTR; // 0x889FB8
struct DynamicVectorClass_AirstrikeClass_PTR_vtbl; // 0x7E293C
struct VectorClass_DiskLaserClass_PTR;
struct VectorClass_DiskLaserClass_PTR_vtbl; // 0x7E5EFC
struct DynamicVectorClass_DiskLaserClass_PTR; // 0x8A0208
struct DynamicVectorClass_DiskLaserClass_PTR_vtbl; // 0x7E5EDC
struct VectorClass_EBolt_PTR;
struct VectorClass_EBolt_PTR_vtbl; // 0x7E86AC
struct DynamicVectorClass_EBolt_PTR; // 0x8A0E88
struct DynamicVectorClass_EBolt_PTR_vtbl; // 0x7E868C
struct VectorClass_TemporalClass_PTR;
struct VectorClass_TemporalClass_PTR_vtbl; // 0x7F5134
struct DynamicVectorClass_TemporalClass_PTR; // 0xB0EC60
struct DynamicVectorClass_TemporalClass_PTR_vtbl; // 0x7F5114
struct VectorClass_WaveClass_PTR;
struct VectorClass_WaveClass_PTR_vtbl; // 0x7E9D04
struct DynamicVectorClass_WaveClass_PTR; // 0xA8EC38
struct DynamicVectorClass_WaveClass_PTR_vtbl; // 0x7E9CE4
struct VectorClass_LaserDrawClass_PTR;
struct VectorClass_LaserDrawClass_PTR_vtbl; // 0x7ECEFC
struct DynamicVectorClass_LaserDrawClass_PTR; // 0xABC878
struct DynamicVectorClass_LaserDrawClass_PTR_vtbl; // 0x7ECEDC
struct VectorClass_LineTrail_PTR;
struct VectorClass_LineTrail_PTR_vtbl; // 0x7ED0EC
struct DynamicVectorClass_LineTrail_PTR; // 0xABCB78
struct DynamicVectorClass_LineTrail_PTR_vtbl; // 0x7ED0CC
struct VectorClass_RadBeam_PTR;
struct VectorClass_RadBeam_PTR_vtbl; // 0x7F04A4
struct DynamicVectorClass_RadBeam_PTR; // 0xB04A60
struct DynamicVectorClass_RadBeam_PTR_vtbl; // 0x7F0484
struct VectorClass_RadSiteClass_PTR;
struct VectorClass_RadSiteClass_PTR_vtbl; // 0x7F07C4
struct DynamicVectorClass_RadSiteClass_PTR; // 0xB04BD0
struct DynamicVectorClass_RadSiteClass_PTR_vtbl; // 0x7F07A4
struct VectorClass_LightSourceClass_PTR;
struct VectorClass_LightSourceClass_PTR_vtbl; // 0x7ECF9C
struct DynamicVectorClass_LightSourceClass_PTR; // 0xABCA10
struct DynamicVectorClass_LightSourceClass_PTR_vtbl; // 0x7ECF7C
struct VectorClass_ParasiteClass_PTR;
struct VectorClass_ParasiteClass_PTR_vtbl; // 0x7EF844
struct DynamicVectorClass_ParasiteClass_PTR; // 0xAC4910
struct DynamicVectorClass_ParasiteClass_PTR_vtbl; // 0x7EF824
struct VectorClass_Kamikaze_PTR;
struct VectorClass_Kamikaze_PTR_vtbl;
struct DynamicVectorClass_Kamikaze_PTR; // 0xABC604
struct DynamicVectorClass_Kamikaze_PTR_vtbl;
struct VectorClass_KamikazeControl_PTR;
struct VectorClass_KamikazeControl_PTR_vtbl; // 0x7ECE9C
struct DynamicVectorClass_KamikazeControl_PTR;
struct DynamicVectorClass_KamikazeControl_PTR_vtbl; // 0x7ECE7C
struct VectorClass_ConvertClass_PTR;
struct VectorClass_ConvertClass_PTR_vtbl; // 0x7E5338
struct DynamicVectorClass_ConvertClass_PTR; // 0x89ECF8
struct DynamicVectorClass_ConvertClass_PTR_vtbl; // 0x7E5318
struct VectorClass_LightConvertClass_PTR;
struct VectorClass_LightConvertClass_PTR_vtbl; // 0x7E188C
struct DynamicVectorClass_LightConvertClass_PTR; // 0x87F698
struct DynamicVectorClass_LightConvertClass_PTR_vtbl; // 0x7E186C
struct VectorClass_EMPulseClass_PTR;
struct VectorClass_EMPulseClass_PTR_vtbl; // 0x7E875C
struct DynamicVectorClass_EMPulseClass_PTR; // 0x8A3870
struct DynamicVectorClass_EMPulseClass_PTR_vtbl; // 0x7E873C
struct VectorClass_AnimClass_PTR;
struct VectorClass_AnimClass_PTR_vtbl; // 0x7E9F44 / 0x7EBFEC
struct DynamicVectorClass_AnimClass_PTR; // 0xA8E9A8 / 0xA9F9D0 / 0xA9FA18 / 0xA9FA60
struct DynamicVectorClass_AnimClass_PTR_vtbl; // 0x7E9F24 / 0x7EBFCC
struct VectorClass_AnimTypeClass_PTR;
struct VectorClass_AnimTypeClass_PTR_vtbl; // 0x7EA304 / 0x7EB6F4
struct DynamicVectorClass_AnimTypeClass_PTR; // 0x8B4150
struct DynamicVectorClass_AnimTypeClass_PTR_vtbl; // 0x7EA2E4 / 0x7EB714
struct TypeList_AnimTypeClass_PTR;
struct TypeList_AnimTypeClass_PTR_vtbl;
struct VectorClass_VoxelAnimClass_PTR;
struct VectorClass_VoxelAnimClass_PTR_vtbl; // 0x7E1E4C
struct DynamicVectorClass_VoxelAnimClass_PTR; // 0x887388
struct DynamicVectorClass_VoxelAnimClass_PTR_vtbl; // 0x7E1E2C
struct VectorClass_VoxelAnimTypeClass_PTR;
struct VectorClass_VoxelAnimTypeClass_PTR_vtbl; // 0x7F0D5C / 0x7EA3C4
struct DynamicVectorClass_VoxelAnimTypeClass_PTR; // 0xA8EB28
struct DynamicVectorClass_VoxelAnimTypeClass_PTR_vtbl; // 0x7F0DCC / 0x7EA3A4
struct TypeList_VoxelAnimTypeClass_PTR;
struct TypeList_VoxelAnimTypeClass_PTR_vtbl; // 0x7F0D3C
struct VectorClass_AlphaShapeClass_PTR;
struct VectorClass_AlphaShapeClass_PTR_vtbl; // 0x7E3258
struct DynamicVectorClass_AlphaShapeClass_PTR; // 0x88A0F0
struct DynamicVectorClass_AlphaShapeClass_PTR_vtbl; // 0x7E3238
struct VectorClass_IonBlastClass_PTR;
struct VectorClass_IonBlastClass_PTR_vtbl; // 0x7EC07C
struct DynamicVectorClass_IonBlastClass_PTR; // 0xAA0118
struct DynamicVectorClass_IonBlastClass_PTR_vtbl; // 0x7EC05C
struct VectorClass_SpotLightClass_PTR;
struct VectorClass_SpotLightClass_PTR_vtbl; // 0x7EF6DC
struct DynamicVectorClass_SpotLightClass_PTR; // 0xAC1678
struct DynamicVectorClass_SpotLightClass_PTR_vtbl; // 0x7EF6BC
struct VectorClass_VocClass_PTR;
struct VectorClass_VocClass_PTR_vtbl; // 0x7F68CC
struct DynamicVectorClass_VocClass_PTR; // 0xB1D378
struct DynamicVectorClass_VocClass_PTR_vtbl; // 0x7F68AC
struct VectorClass_VoxClass_PTR;
struct VectorClass_VoxClass_PTR_vtbl; // 0x7F6924
struct DynamicVectorClass_VoxClass_PTR; // 0xB1D4A0
struct DynamicVectorClass_VoxClass_PTR_vtbl; // 0x7F6904
struct VectorClass_TriggerClass_PTR;
struct VectorClass_TriggerClass_PTR_vtbl; // 0x7E9C04
struct DynamicVectorClass_TriggerClass_PTR; // 0xA8EAE8
struct DynamicVectorClass_TriggerClass_PTR_vtbl; // 0x7E9BE4
struct VectorClass_TriggerTypeClass_PTR;
struct VectorClass_TriggerTypeClass_PTR_vtbl; // 0x7E9BC4
struct DynamicVectorClass_TriggerTypeClass_PTR; // 0x8B4178
struct DynamicVectorClass_TriggerTypeClass_PTR_vtbl; // 0x7E9BA4
struct VectorClass_AITriggerTypeClass_PTR;
struct VectorClass_AITriggerTypeClass_PTR_vtbl; // 0x7E9B84
struct DynamicVectorClass_AITriggerTypeClass_PTR; // 0xA8B200
struct DynamicVectorClass_AITriggerTypeClass_PTR_vtbl; // 0x7E9B64
struct VectorClass_TeamClass_PTR;
struct VectorClass_TeamClass_PTR_vtbl; // 0x7E9F84
struct DynamicVectorClass_TeamClass_PTR; // 0x8B40E8
struct DynamicVectorClass_TeamClass_PTR_vtbl; // 0x7E9F64
struct VectorClass_TeamTypeClass_PTR;
struct VectorClass_TeamTypeClass_PTR_vtbl; // 0x7EA104 / 0x7EA9E4
struct DynamicVectorClass_TeamTypeClass_PTR; // 0xA8ECA0
struct DynamicVectorClass_TeamTypeClass_PTR_vtbl; // 0x7EA0E4 / 0x7EAAE8
struct TypeList_TeamTypeClass_PTR;
struct TypeList_TeamTypeClass_PTR_vtbl; // 0x7EA9C4
struct VectorClass_TaskForceClass_PTR;
struct VectorClass_TaskForceClass_PTR_vtbl; // 0x7EA0C4
struct DynamicVectorClass_TaskForceClass_PTR; // 0xA8E8D0
struct DynamicVectorClass_TaskForceClass_PTR_vtbl; // 0x7EA0A4
struct VectorClass_ScriptClass_PTR;
struct VectorClass_ScriptClass_PTR_vtbl; // 0x7E1B44
struct DynamicVectorClass_ScriptClass_PTR; // 0x8872B0
struct DynamicVectorClass_ScriptClass_PTR_vtbl; // 0x7E1B24
struct VectorClass_ScriptTypeClass_PTR;
struct VectorClass_ScriptTypeClass_PTR_vtbl; // 0x7EA144
struct DynamicVectorClass_ScriptTypeClass_PTR; // 0x8B41C8
struct DynamicVectorClass_ScriptTypeClass_PTR_vtbl; // 0x7EA124
struct VectorClass_HouseClass_PTR;
struct VectorClass_HouseClass_PTR_vtbl; // 0x7E9F04
struct DynamicVectorClass_HouseClass_PTR; // 0xA80228
struct DynamicVectorClass_HouseClass_PTR_vtbl; // 0x7E9EE4
struct VectorClass_HouseTypeClass_PTR;
struct VectorClass_HouseTypeClass_PTR_vtbl; // 0x7EA084
struct DynamicVectorClass_HouseTypeClass_PTR; // 0xA83C98
struct DynamicVectorClass_HouseTypeClass_PTR_vtbl; // 0x7EA064
struct VectorClass_SideClass_PTR;
struct VectorClass_SideClass_PTR_vtbl; // 0x7EA044
struct DynamicVectorClass_SideClass_PTR; // 0x8B4120
struct DynamicVectorClass_SideClass_PTR_vtbl; // 0x7EA024
struct VectorClass_EventClass_PTR;
struct VectorClass_EventClass_PTR_vtbl; // 0x7EFE24
struct DynamicVectorClass_EventClass_PTR; // 0xAC4B48 / 0xB0F1A0
struct DynamicVectorClass_EventClass_PTR_vtbl; // 0x7EFE04
struct VectorClass_TEventClass_PTR;
struct VectorClass_TEventClass_PTR_vtbl; // 0x7F552C
struct DynamicVectorClass_TEventClass_PTR; // 0xB0F1A0
struct DynamicVectorClass_TEventClass_PTR_vtbl; // 0x7F550C
struct VectorClass_TActionClass_PTR;
struct VectorClass_TActionClass_PTR_vtbl; // 0x7F43F0
struct DynamicVectorClass_TActionClass_PTR; // 0xB0E658
struct DynamicVectorClass_TActionClass_PTR_vtbl; // 0x7F43D0
struct VectorClass_SmudgeClass_PTR;
struct VectorClass_SmudgeClass_PTR_vtbl; // 0x7E9DC4
struct DynamicVectorClass_SmudgeClass_PTR; // 0xA8B1E0
struct DynamicVectorClass_SmudgeClass_PTR_vtbl; // 0x7E9DA4
struct VectorClass_RadarEventClass_PTR;
struct VectorClass_RadarEventClass_PTR_vtbl; // 0x7F0ACC
struct DynamicVectorClass_RadarEventClass_PTR; // 0xB04DA8
struct DynamicVectorClass_RadarEventClass_PTR_vtbl; // 0x7F0AAC
struct VectorClass_ThemeControl_PTR;
struct VectorClass_ThemeControl_PTR_vtbl; // 0x7EA584
struct DynamicVectorClass_ThemeControl_PTR;
struct DynamicVectorClass_ThemeControl_PTR_vtbl; // 0x7F568C
struct VectorClass_CampaignClass_PTR;
struct VectorClass_CampaignClass_PTR_vtbl; // 0x7EA004
struct DynamicVectorClass_CampaignClass_PTR;
struct DynamicVectorClass_CampaignClass_PTR_vtbl; // 0x7E9FE4
struct VectorClass_MPGameModeClass_PTR;
struct VectorClass_MPGameModeClass_PTR_vtbl; // 0x7EED40
struct DynamicVectorClass_MPGameModeClass_PTR; // 0xABFDA0
struct DynamicVectorClass_MPGameModeClass_PTR_vtbl; // 0x7EED20
struct VectorClass_AlphaLightingRemapClass_PTR;
struct VectorClass_AlphaLightingRemapClass_PTR_vtbl;
struct DynamicVectorClass_AlphaLightingRemapClass_PTR; // 0x0x88A080
struct DynamicVectorClass_AlphaLightingRemapClass_PTR_vtbl;

// TODO VECTOR

class AbstractClass; // Abstract Tree Base
struct AbstractClass_vtbl; // 0x7E1F50
class AbstractTypeClass; // : AbstractClass
struct AbstractTypeClass_vtbl; // 0x7E2000
class TagClass; // : AbstractClass
struct TagClass_vtbl; // 0x7F44E0
class TagTypeClass; // : AbstractTypeClass : AbstractClass
struct TagTypeClass_vtbl; // 0x7F45C4
class TriggerClass; // : AbstractClass
struct TriggerClass_vtbl; // 0x7F5858
class TriggerTypeClass; // : AbstractTypeClass : AbstractClass
struct TriggerTypeClass_vtbl; // 0x7F5904
class CampaignClass; // : AbstractTypeClass : AbstractClass
struct CampaignClass_vtbl; // 0x7E4A28
class WaypointPathClass; // : AbstractClass
struct WaypointPathClass_vtbl; // 0x7F6E70
class HouseClass; // : AbstractClass
struct HouseClass_vtbl; // 0x7EA8A0
class HouseTypeClass; // : AbstractTypeClass : AbstractClass
struct HouseTypeClass_vtbl; // 0x7EAB58
class FileClass; // File Tree Base
struct FileClass_vtbl; // 0x7F08BC
class RawFileClass; // : FileClass
struct RawFileClass_vtbl; // 0x7F0904
class BufferIOFileClass; // : RawFileClass : FileClass
struct BufferIOFileClass_vtbl; // 0x7E3A2C
class CDFileClass; // : BufferIOFileClass : RawFileClass : FileClass
struct CDFileClass_vtbl; // 0x7E1668
class CCFileClass; // : CDFileClass : BufferIOFileClass : RawFileClass : FileClass
struct CCFileClass_vtbl; // 0x7E16B0
class BombClass; // : AbstractClass
struct BombClass_vtbl; // 0x7E3D10
class ConvertClass; // Convert Tree Base
struct ConvertClass_vtbl; // 0x7E5358
class LightConvertClass; // : ConvertClass
struct LightConvertClass_vtbl; // 0x7ED0A4
class ObjectClass; // : AbstractClass
struct ObjectClass_vtbl; // 0x7EF060
class ObjectTypeClass; // : AbstractTypeClass : AbstractClass
struct ObjectTypeClass_vtbl; // 0x7EF2D8
class AnimClass; // : ObjectClass : AbstractClass
struct AnimClass_vtbl; // 0x7E3354
class AnimTypeClass; // : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct AnimTypeClass_vtbl; // 0x7E3608
class SmudgeClass; // : ObjectClass : AbstractClass
struct SmudgeClass_vtbl; // 0x7F32FC
class SmudgeTypeClass; // : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct SmudgeTypeClass_vtbl; // 0x7F3528
class SuperClass; // : AbstractClass
struct SuperClass_vtbl; // 0x7F3FE8
class SuperWeaponTypeClass; // : AbstractTypeClass : AbstractClass
struct SuperWeaponTypeClass_vtbl; // 0x7F4090
class ScriptClass; // : AbstractClass
struct ScriptClass_vtbl; // 0x7F0F78
class ScriptTypeClass; // : AbstractTypeClass : AbstractClass
struct ScriptTypeClass_vtbl; // 0x7F1008
class TeamClass; // : AbstractClass
struct TeamClass_vtbl; // 0x7F4730
class TeamTypeClass; // : AbstractTypeClass : AbstractClass
struct TeamTypeClass_vtbl; // 0x7F47D0
class TActionClass; // : AbstractClass
struct TActionClass_vtbl; // 0x7F443C
class TaskForceClass; // : AbstractTypeClass : AbstractClass
struct TaskForceClass_vtbl; // 0x7F4680
class TEventClass; // : AbstractClass
struct TEventClass_vtbl; // 0x7F5578
class WaypointPathClass; // : AbstractClass
struct WaypointPathClass_vtbl; // 0x7F6E70
class AirstrikeClass; // : AbstractClass
struct AirstrikeClass_vtbl; // 0x7E29A8
class CaptureManagerClass; // : AbstractClass
struct CaptureManagerClass_vtbl; // 0x7E4B40
class SpawnManagerClass; // : AbstractClass
struct SpawnManagerClass_vtbl; // 0x7F3650
class SlaveManagerClass; // : AbstractClass
struct SlaveManagerClass_vtbl; // 0x7F31C8
class ParasiteClass; // : AbstractClass
struct ParasiteClass_vtbl; // 0x7EF890
class FactoryClass; // : AbstractClass
struct FactoryClass_vtbl; // 0x7E88D0
class LightSourceClass; // : AbstractClass
struct LightSourceClass_vtbl; // 0x7ED028
class RadSiteClass; // : AbstractClass
struct RadSiteClass_vtbl; // 0x7F0810
class AlphaShapeClass; // : AbstractClass
struct AlphaShapeClass_vtbl; // 0x7E32A4
class EMPulseClass; // : AbstractClass
struct EMPulseClass_vtbl; // 0x7E87A8
class TemporalClass; // : AbstractClass
struct TemporalClass_vtbl; // 0x7F5180
class NeuronClass; // : AbstractClass
struct NeuronClass_vtbl; // 0x7E3DF0
class DiskLaserClass; // : AbstractClass
struct DiskLaserClass_vtbl; // 0x7E5FB8
class SideClass; // : AbstractTypeClass : AbstractClass
struct SideClass_vtbl; // 0x7F2EC0
class AITriggerTypeClass; // : AbstractTypeClass : AbstractClass
struct AITriggerTypeClass_vtbl; // 0x7E2A50
class TiberiumClass; // : AbstractTypeClass : AbstractClass
struct TiberiumClass_vtbl; // 0x7F5728
class VoxelAnimClass; // : ObjectClass : AbstractClass
struct VoxelAnimClass_vtbl; // 0x7F6318
class VoxelAnimTypeClass; // : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct VoxelAnimTypeClass_vtbl; // 0x7F6548
class WarheadTypeClass; // : AbstractTypeClass : AbstractClass
struct WarheadTypeClass_vtbl; // 0x7F6B30
class WeaponTypeClass; // : AbstractTypeClass : AbstractClass
struct WeaponTypeClass_vtbl; // 0x7F73B8
class ParticleClass; // : ObjectClass : AbstractClass
struct ParticleClass_vtbl; // 0x7EF954
class ParticleTypeClass; // : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct ParticleTypeClass_vtbl; // 0x7F0188
class ParticleSystemClass; // : ObjectClass : AbstractClass
struct ParticleSystemClass_vtbl; // 0x7EFB9C
class ParticleSystemTypeClass; // : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct ParticleSystemTypeClass_vtbl; // 0x7F00A8
class BulletClass; // : ObjectClass : AbstractClass
struct BulletClass_vtbl; // 0x7E46E4
class BulletTypeClass; // : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct BulletTypeClass_vtbl; // 0x7E4948
class OverlayClass; // : ObjectClass : AbstractClass
struct OverlayClass_vtbl; // 0x7EF3D4
class OverlayTypeClass; // : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct OverlayTypeClass_vtbl; // 0x7EF600
class CellClass; // : AbstractClass
struct CellClass_vtbl; // 0x7E4EEC
class WaveClass; // : ObjectClass : AbstractClass
struct WaveClass_vtbl; // 0x7F6BF4
class MissionClass; // : ObjectClass : AbstractClass
struct MissionClass_vtbl; // 0x7EDCC0
class RadioClass; // : MissionClass : ObjectClass : AbstractClass
struct RadioClass_vtbl; // 0x7F0508
class TechnoClass; // : RadioClass : MissionClass : ObjectClass : AbstractClass
struct TechnoClass_vtbl; // 0x7F4960
class TechnoTypeClass; // : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct TechnoTypeClass_vtbl; // 0x7F4ED8
class LinkClass; // Link Tree Base
struct LinkClass_vtbl; // 0x7E9344
class GadgetClass; // : LinkClass
struct GadgetClass_vtbl; // 0x7E92BC
class GScreenClass; // GScreen Tree Base
struct GScreenClass_vtbl; // 0x7EA6FC
class MapClass; // : GScreenClass
struct MapClass_vtbl; // 0x7ED404
class DisplayClass; // : MapClass : GScreenClass
struct DisplayClass_vtbl; // 0x7E6114
class RadarClass; // : DisplayClass : MapClass : GScreenClass
struct RadarClass_vtbl; // 0x7F0344
class PowerClass; // : RadarClass : DisplayClass : MapClass : GScreenClass
struct PowerClass_vtbl; // 0x7EFF54
class SidebarClass; // : PowerClass : RadarClass : DisplayClass : MapClass : GScreenClass
struct SidebarClass_vtbl; // 0x7F3058
class TabClass; // : SidebarClass : PowerClass : RadarClass : DisplayClass : MapClass : GScreenClass
struct TabClass_vtbl; // 0x7EDFB4
class ScrollClass; // : TabClass : SidebarClass : PowerClass : RadarClass : DisplayClass : MapClass : GScreenClass
struct ScrollClass_vtbl; // 0x7F1094
class MouseClass; // 0x87F7E8 (4CurrentPlayer)  : ScrollClass : TabClass : SidebarClass : PowerClass : RadarClass : DisplayClass : MapClass : GScreenClass
struct MouseClass_vtbl; // 0x7E1964
class TacticalClass; // : AbstractClass
struct TacticalClass_vtbl; // 0x7F4348
class BuildingLightClass; // : ObjectClass : AbstractClass
struct BuildingLightClass_vtbl; // 0x7E3AD0
class BuildingClass; // : TechnoClass : RadioClass : MissionClass : ObjectClass : AbstractClass
struct BuildingClass_vtbl; // 0x7E3EBC
class BuildingTypeClass; // : TechnoTypeClass : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct BuildingTypeClass_vtbl; // 0x7E4570
class FootClass; // : TechnoClass : RadioClass : MissionClass : ObjectClass : AbstractClass
struct FootClass_vtbl; // 0x7E8C94
class InfantryClass; // : FootClass : TechnoClass : RadioClass : MissionClass : ObjectClass : AbstractClass
struct InfantryClass_vtbl; // 0x7EB058
class InfantryTypeClass; // : TechnoTypeClass : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct InfantryTypeClass_vtbl; // 0x7EB610
class UnitClass; // : FootClass : TechnoClass : RadioClass : MissionClass : ObjectClass : AbstractClass
struct UnitClass_vtbl; // 0x7F5C70
class UnitTypeClass; // : TechnoTypeClass : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct UnitTypeClass_vtbl; // 0x7F6218
class AircraftClass; // : FootClass : TechnoClass : RadioClass : MissionClass : ObjectClass : AbstractClass
struct AircraftClass_vtbl; // 0x7E22A4
class AircraftTypeClass; // : TechnoTypeClass : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct AircraftTypeClass_vtbl; // 0x7E2868
class TerrainClass; // : ObjectClass : AbstractClass
struct TerrainClass_vtbl; // 0x7F522C
class TerrainTypeClass; // : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct TerrainTypeClass_vtbl; // 0x7F5458
class Surface; // Surface Tree Base
struct Surface_vtbl; // 0x7E2198
class XSurface; // : Surface
struct XSurface_vtbl; // 0x7E2104
class DSurface; // : XSurface : Surface
struct DSurface_vtbl; // 0x7E85D4
class BSurface; // : XSurface : Surface
struct BSurface_vtbl; // 0x7E2070
class LocomotionClass; // Locomotion Tree Base
struct LocomotionClass_vtbl; // 0x7EAEC0
class JumpjetLocomotionClass; // : LocomotionClass
struct JumpjetLocomotionClass_vtbl; // 0x7ECE34
class FlyLocomotionClass; // : LocomotionClass
struct FlyLocomotionClass_vtbl; // 0x7E8AC0
class TeleportLocomotionClass; // : LocomotionClass
struct TeleportLocomotionClass_vtbl; // 0x7F50CC
class ShipLocomotionClass; // : LocomotionClass
struct ShipLocomotionClass_vtbl; // 0x7F2E58
class DriveLocomotionClass; // : LocomotionClass
struct DriveLocomotionClass_vtbl; // 0x7E7F7C
class TunnelLocomotionClass; // : LocomotionClass
struct TunnelLocomotionClass_vtbl; // 0x7F5AF0
class DropPodLocomotionClass; // : LocomotionClass
struct DropPodLocomotionClass_vtbl; // 0x7E8344
class RocketLocomotionClass; // : LocomotionClass
struct RocketLocomotionClass_vtbl; // 0x7F0BE8
class HoverLocomotionClass; // : LocomotionClass
struct HoverLocomotionClass_vtbl; // 0x7EADC8
class MechLocomotionClass; // : LocomotionClass
struct MechLocomotionClass_vtbl; // 0x7EDC38
class WalkLocomotionClass; // : LocomotionClass
struct WalkLocomotionClass_vtbl; // 0x7F6AC4
class TextLabelClass; // : GadgetClass : LinkClass
struct TextLabelClass_vtbl; // 0x7F5B44
class LayerClass; // Layer Tree Base ( : DynamicVectorClass_ObjectClass_PTR)
struct LayerClass_vtbl; // 0x7E6060
class LogicClass; // : LayerClass
struct LogicClass_vtbl; // 0x7E18FC
class VeinholeMonsterClass; // : ObjectClass : AbstractClass
struct VeinholeMonsterClass_vtbl; // 0x7F66A8
class IsometricTileClass; // : ObjectClass : AbstractClass
struct IsometricTileClass_vtbl; // 0x7EC258
class IsometricTileTypeClass; // : ObjectTypeClass : AbstractTypeClass : AbstractClass
struct IsometricTileTypeClass_vtbl; // 0x7ECC48
class ControlClass; // : GadgetClass : LinkClass
struct ControlClass_vtbl; // 0x7E528C
class ToggleClass; // : ControlClass : GadgetClass : LinkClass
struct ToggleClass_vtbl; // 0x7E8118
class ShapeButtonClass; // : ToggleClass : ControlClass : GadgetClass : LinkClass
struct ShapeButtonClass_vtbl; // 0x7E8088
class EditClass; // : ControlClass : GadgetClass : LinkClass
struct EditClass_vtbl; // 0x7E81A4
class GaugeClass; // : ControlClass : GadgetClass : LinkClass
struct GaugeClass_vtbl; // 0x7E9384
class SliderClass; // : GaugeClass : ControlClass : GadgetClass : LinkClass
struct SliderClass_vtbl; // 0x7ED21C
class ListClass; // : ControlClass : GadgetClass : LinkClass
struct ListClass_vtbl; // 0x7ED10C
class DropListClass; // : EditClass : ControlClass : GadgetClass : LinkClass
struct DropListClass_vtbl; // 0x7E7FCC
class TriColorGaugeClass; // : GaugeClass : ControlClass : GadgetClass : LinkClass
struct TriColorGaugeClass_vtbl; // 0x7E9430
class CheckListClass; // : ListClass : ControlClass : GadgetClass : LinkClass
struct CheckListClass_vtbl; // 0x7E4F84
class ColorListClass; // : ListClass : ControlClass : GadgetClass : LinkClass
struct ColorListClass_vtbl; // 0x7E5054
class CommandClass; // FIXME Command Tree Base (Subs exist)
struct CommandClass_vtbl; // 0x7EBE3C
class MPGameModeClass; // FIXME MPGameMode Tree Base (Subs exist)
struct MPGameModeClass_vtbl; // 0x7EED60
class GGadgetClass; // : GadgetClass : LinkClass
struct GGadgetClass_vtbl; // 0x7F02BC
class SelectClass; // : ControlClass : GadgetClass : LinkClass
struct SelectClass_vtbl; // 0x7F2FCC

// TODO CLASS

union Union_Large_Int;
union Union_U_Large_Int;
union Union_In_addr_unnamed_type_un;
union Union_DDD_D_SURFACE_DESC2_lPitch;
union Union_DDD_D_SURFACE_DESC2_dw;
union Union_DDD_D_SURFACE_DESC2_D_D_COLOR_KEY;
union Union_DDD_D_SURFACE_DESC2_D_D_PIXEL_FORMAT;
union Union_D_D_PIXEL_FORMAT_dw1;
union Union_D_D_PIXEL_FORMAT_dw2;
union Union_D_D_PIXEL_FORMAT_dw3;
union Union_D_D_PIXEL_FORMAT_dw4;
union Union_D_D_PIXEL_FORMAT_dw5;
union Union_CRCEngine_unnamed_type_StagingBuffer;
union Union_INIClass_Sections;
union Union_LoadOptionsClass_FileEntries;
union Union_BaseClass_BaseNodes;
union Union_BaseClass_Cells_24;
union Union_BaseClass_Cells_38;
union Union_IndexClass_SectionIndex;
union Union_HouseClass_RelatedTags;
union Union_HouseClass_ConYards;
union Union_HouseClass_Buildings;
union Union_HouseClass_UnitRepairStations;
union Union_HouseClass_Grinders;
union Union_HouseClass_Absorbers;
union Union_HouseClass_Bunkers;
